Информационная_база/src/Documents/РеализацияТоваров/РеализацияТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваров</name>
  <registerRecords>AccumulationRegister.СебестоимостьТоваров</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСКлиентами</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <registerRecords>AccountingRegister.РегистрБухгалтерии</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудник</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>EnumRef.Валюта</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Информационная_база/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>КурсВалюты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюты</name>
    <type>
      <types>EnumRef.Валюта</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Информационная_база/src/Documents/РеализацияТоваров/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	Элементы.Товары.ТекущиеДанные.Цена = Элементы.Товары.ТекущиеДанные.Сумма / Элементы.Товары.ТекущиеДанные.Количество;
КонецПроцедуры

&НаКлиенте
Функция Печать(Команда)
	ТабДок = ПечатьНаСервере();
	ТабДок.Показать();
КонецФункции

&НаСервере
Функция ПечатьНаСервере()
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = Документы.РеализацияТоваров.ПолучитьМакет("Макет");
	
	ОблШапка = Макет.ПолучитьОбласть("ОблШапка");
	ОблСтрока = Макет.ПолучитьОбласть("ОблСтрока");
	ОблПодвал = Макет.ПолучитьОбласть("ОблПодвал");
	
	ОблШапка.Параметры.НомерДокумента = Объект.Номер;
	ОблШапка.Параметры.ДатаДокумента = Формат(Объект.Дата,"ДЛФ=ДД" );
	ТабДок.Вывести(ОблШапка);
	
	Для Каждого Стр Из Объект.Товары Цикл
		ОблСтрока.Параметры.Заполнить(Стр);
		ТабДок.Вывести(ОблСтрока);
	КонецЦикла;	
	
	ОблПодвал.Параметры.Заполнить(Объект);
	ОблПодвал.Параметры.Валюта = Объект.ВалютаДокумента;
	ОблПодвал.Параметры.Сумма = Объект.Товары.Итог("Сумма");
	ТабДок.Вывести(ОблПодвал);
	
	Возврат ТабДок;

КонецФункции







&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
 
	
	Товар = Элементы.Товары.ТекущиеДанные;
	Элементы.Товары.ТекущиеДанные.Сумма = РассчитатьСумму(Товар);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	Товар = Элементы.Товары.ТекущиеДанные;
	Элементы.Товары.ТекущиеДанные.Сумма = РассчитатьСумму(Товар);
	
КонецПроцедуры



&НаКлиенте
Функция РассчитатьСумму(Товар)
	Товар.Сумма = Товар.Цена * Товар.Количество;
	Возврат Товар.Сумма;
КонецФункции



&НаКлиенте
Процедура ВалютаДокументаПриИзменении1(Элемент)
	КурсКРублю = ВозвратКурсаВалюты(Объект.Дата, Объект.ВалютаДокумента);
КонецПроцедуры




&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	КурсКРублю = ВозвратКурсаВалюты(Объект.Дата, Объект.ВалютаДокумента);
КонецПроцедуры



&НаСервере
Функция ВозвратКурсаВалюты(АктуальнаяДата, ЭлементНоменклатуры) 
	
	Отбор = Новый Структура ("Валюты", ЭлементНоменклатуры);
	ЗначениеРесурсов = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(АктуальнаяДата, Отбор);
	Возврат ЗначениеРесурсов.КурсВалюты;
	
КонецФункции
